// agreement.dart

const String agreementContent = '''
売 買 契 約 書
買主　APUshion （以下「甲」という）と売主　　　　　　　（以下「乙」という）は、商品の売買に関し以下のとおり売買契約を締結する。

第１条（基本合意）
甲と乙は、乙が甲に対し、　　　　　　　　　　　　　　（以下「本件商品」という）を、代金　　　　　　　　　円（税込）にて売り渡し、甲がこれを買い受けることを合意する。

第２条（引渡し）
１　乙は、甲に対し、令和　　年　　月　　日、　　　　　　　にて、本件商品を引き渡す。
２　甲または乙は、相手方の承諾を得て、引渡日もしくは引渡し場所を変更することができる。ただし、変更により費用が増加した場合、増加分は変更を申し出た者の負担とする。

第３条（代金の支払い）
　甲は、乙に対し、前条の引渡しと同時に、本件商品の代金を支払う。

第４条（所有権の移転）
　本件商品の所有権は、第２条および第３条により、本件商品の引渡しと同時に代金の支払いが完了した時点で、甲に移転する。

第５条（危険負担）
甲乙双方の責めに帰すべき事由以外の事由による本件商品の滅失、損傷、変質その他の損害は、第２条の引渡し前までは乙の、引渡し後については甲の負担とする。
なお、乙は、甲に対して、本件商品は通常の使用が可能な品質を有することを保証する。

第６条（契約不適合の責任）
１　甲への引渡し完了後、本件商品に種類、品質または数量に関しての本契約内容への不適合が発見された場合、甲は直ちにこれを乙に通知する。
２　前項の発見時期が第３項に定める保証期間内の場合、甲は乙に対し目的物の代金の減額、乙の負担による本件商品の修理、代品の納入を求めることができる。但し、当該契約不適合が甲の責に帰すべき事由によることが明らかである場合はこの限りでない。
３　保証期間とは、本件商品の引渡し完了の日から７日間をいう。

第７条（契約の解除）
甲または乙が、本契約の各条項に違反した場合は、相当の期間を定めてその履行ないし是正を催告することができ、それにもかかわらず相手方が催告に従う履行または是正をしないときは、本契約を解除することができる。なお、この解除は、解除した当事者による相手方に対する損害賠償の請求を妨げない。

第８条（協議事項）
　本契約に定めのない事項および本契約の解釈につき相違のある事項については、甲および乙は、信義誠実に基づく協議の上、円満に解決するものとする。

第９条（合意管轄）
　本契約に関連する訴訟については、大分地方裁判所を第一審の専属的合意管轄裁判所とする。

甲と乙は、本契約の証として、本契約書を２通作成し、各自記名押印のうえ１通を所持する。
''';
